tutorials/CFD/07NonIsothermalMixingElbow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall-4
    {
        type            noSlip;
    }

    velocity-inlet-5

    {
        type            fixedValue;
        value           uniform (0.6 0 0);
    }

    velocity-inlet-6

    {
        type            fixedValue;
        value           uniform (0 1.2 0);
    }

    pressure-outlet-7
    {
        type            zeroGradient;
    }

  

    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
