tutorials/CFD/07NonIsothermalMixingElbow/0/Tlift2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Tlift2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
2200
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    wall-4
    {
        type            zeroGradient;
    }
    pressure-outlet-7
    {
        type            zeroGradient;
    }
    velocity-inlet-6
    {
        type            fixedValue;
        value           uniform 0;
    }
    velocity-inlet-5
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
