tutorials/CFD/07NonIsothermalMixingElbow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(T|TFinal)" 
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0;
    };

    Tlift0
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    };

    Tlift1
    {
       solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    };
    
    Tlift2 
    { solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    };
 Tlift3 
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    };
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    }

  "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }
    Usup
    {
	    solver           GAMG;
        tolerance        1e-7;
        relTol           0.001;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }

 Phi
    {
        $p;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}


PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
}
SIMPLE
{
    nNonOrthogonalCorrectors 2;
    pRefCell 0;
    pRefValue 0;
}
PIMPLE
{
    nNonOrthogonalCorrectors 1;
    pRefCell 0;
    pRefValue 0;
}


// ************************************************************************* //
